package ua.university.ui;

import java.util.Scanner;

public class ConsoleMenu {
    public void consoleMenu()
    {
        System.out.println("Вітаємо у клініці ПУПУПУ!");
        System.out.println("Що Вас цікавить?");

        //дані, які можна подивитись без авторизації, тобто загальнодоступні
        Scanner sc = new Scanner(System.in);


        System.out.println("1 - Розклад клініки");
        System.out.println("2 - Лікарі");
        //Scanner
        //I forgot how to scan so we have IF ELSE
        //сканер 1 - переходимо на просто розклад лікарні, стандартні дані
        //сканер 2 - переходимо в розділи:
        //- Список лікарів по групам, тобто:
        /* 1 - Дитячий відділ
        * 2 - Дорослий відділ
        *
        * для кожного відділу свої лікарі по категоріях, умовні педіатри, лори, рентген (навіть якщо він спільний кабінет має), УЗД і тд
        *
        * ДАЛІ:
        * Можна подивитись категорії
        * ПО КАТЕГОРІЯМ ПОДИВИТИСЬ НАЙБЛИЖЧИЙ ЧАС ЗАПИСУ, АБО ВСІХ ЛІКАРІВ
        * з категорій потрапляємо у розклад
        * з лікарів подивитись у розклад
        * ЩОБ ЗАПИСАТИСЬ НА ПРИЙОМ ПОТРІБНО НАТИСНУТИ ВИХІД З УСХ КАТЕГОРІЙ
        * ДАЛІ АВТЕНТИФІКАЦІЯ
        *
        * Якщо ви лікар: Вхід по базі даних, реєструє ЛИШЕ адміністратор, дивитесь свій графік(його можна змінити), профіль (його змінює умовний адмін в сенсі ступенів, освіти імя і тд)
        * Також можна подивитись прийоми, їх час можна змінити і тоді у пацієнта буде повідомлення про зміну часу
        *
        * Якщо ви пацієнт:
        * на кожен варіант часу запропонований лікар, про лікаря можна почитати детальніше
        *
        *
        * */






        System.out.println("Оберіть опцію, яка найбільше Вам підходить: ");


    }
    }

















